# SegmentIsTooShort Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GenericMEPFailures..::..SegmentIsTooShort Property
BuiltInFailures..::..GenericMEPFailures Class See Also
---
The segment is too short.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SegmentIsTooShort { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SegmentIsTooShort As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SegmentIsTooShort {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GenericMEPFailures Class
Autodesk.Revit.DB Namespace